tutorials/DXIsoFlow/PistonTypeWavemaker/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    location        "system";
    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     DXIsoFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo	    0.5;

maxDeltaT       0.025;

// ************************************************************************* //

functions
{
	surfaceElevation
	{
	type            sets;
	libs            ("libsampling.so");
	writeControl    outputTime;
	writeInterval   1;

	interpolationScheme cellPoint;

	setFormat       raw;

	sets
	(
	    GaugeVOF00
	    {
		type    uniform;
		nPoints  800;
		axis    z;
		start   ( 1.0 0.01 -0.2 );
		end     ( 1.0 0.01 0.2 );
	    }   
	    GaugeVOF01
	    {
		type    uniform;
		nPoints  800;
		axis    z;
		start   ( 4.0 0.01 -0.2 );
		end     ( 4.0 0.01 0.2 );
	    }   
	    GaugeVOF02
	    {
		type    uniform;
		nPoints  800;
		axis    z;
		start   ( 4.4 0.01 -0.2 );
		end     ( 4.4 0.01 0.2 );
	    }   
	    GaugeVOF03
	    {
		type    uniform;
		nPoints  800;
		axis    z;
		start   ( 8.7 0.01 -0.2 );
		end     ( 8.7 0.01 0.2 );
	    } 
);

fields          ( alpha.water );

}
}
